Ac6Embedded/svd-microchip/PIC32CM_SG00/PIC32CM5112SG00048.svd
            <register>
               <name>NDAT2</name>
               <description>New Data 2</description>
               <addressOffset>0x19C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>ND32</name>
                     <description>New Data 32</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND33</name>
                     <description>New Data 33</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND34</name>
                     <description>New Data 34</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND35</name>
                     <description>New Data 35</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND36</name>
                     <description>New Data 36</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND37</name>
                     <description>New Data 37</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND38</name>
                     <description>New Data 38</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND39</name>
                     <description>New Data 39</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND40</name>
                     <description>New Data 40</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND41</name>
                     <description>New Data 41</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND42</name>
                     <description>New Data 42</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND43</name>
                     <description>New Data 43</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND44</name>
                     <description>New Data 44</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND45</name>
                     <description>New Data 45</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND46</name>
                     <description>New Data 46</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND47</name>
                     <description>New Data 47</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND48</name>
                     <description>New Data 48</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND49</name>
                     <description>New Data 49</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND50</name>
                     <description>New Data 50</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND51</name>
                     <description>New Data 51</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND52</name>
                     <description>New Data 52</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND53</name>
                     <description>New Data 53</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND54</name>
                     <description>New Data 54</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND55</name>
                     <description>New Data 55</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND56</name>
                     <description>New Data 56</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND57</name>
                     <description>New Data 57</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND58</name>
                     <description>New Data 58</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND59</name>
                     <description>New Data 59</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND60</name>
                     <description>New Data 60</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND61</name>
                     <description>New Data 61</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND62</name>
                     <description>New Data 62</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>ND63</name>
                     <description>New Data 63</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RXF0C</name>
               <description>Rx FIFO 0 Configuration</description>
               <addressOffset>0x1A0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>F0SA</name>
                     <description>Rx FIFO 0 Start Address</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
                  <field>
                     <name>F0S</name>
                     <description>Rx FIFO 0 Size</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>F0WM</name>
                     <description>Rx FIFO 0 Watermark</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>F0OM</name>
                     <description>FIFO 0 Operation Mode</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RXF0S</name>
               <description>Rx FIFO 0 Status</description>
               <addressOffset>0x1A4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>F0FL</name>
                     <description>Rx FIFO 0 Fill Level</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>F0GI</name>
                     <description>Rx FIFO 0 Get Index</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>F0PI</name>
                     <description>Rx FIFO 0 Put Index</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>F0F</name>
                     <description>Rx FIFO 0 Full</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RF0L</name>
                     <description>Rx FIFO 0 Message Lost</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RXF0A</name>
               <description>Rx FIFO 0 Acknowledge</description>
               <addressOffset>0x1A8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>F0AI</name>
                     <description>Rx FIFO 0 Acknowledge Index</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RXBC</name>
               <description>Rx Buffer Configuration</description>
               <addressOffset>0x1AC</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RBSA</name>
                     <description>Rx Buffer Start Address</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RXF1C</name>
               <description>Rx FIFO 1 Configuration</description>
               <addressOffset>0x1B0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>F1SA</name>
                     <description>Rx FIFO 1 Start Address</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>14</bitWidth>
                  </field>
                  <field>
                     <name>F1S</name>
                     <description>Rx FIFO 1 Size</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>F1WM</name>
                     <description>Rx FIFO 1 Watermark</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>F1OM</name>
                     <description>FIFO 1 Operation Mode</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RXF1S</name>
               <description>Rx FIFO 1 Status</description>
               <addressOffset>0x1B4</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>F1FL</name>
                     <description>Rx FIFO 1 Fill Level</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>7</bitWidth>
                  </field>
                  <field>
                     <name>F1GI</name>
                     <description>Rx FIFO 1 Get Index</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>F1PI</name>
                     <description>Rx FIFO 1 Put Index</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
                  <field>
                     <name>F1F</name>
                     <description>Rx FIFO 1 Full</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RF1L</name>
                     <description>Rx FIFO 1 Message Lost</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>DMS</name>
                     <description>Debug Message Status</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>DMSSelect</name>
                        <enumeratedValue>
                           <name>IDLE</name>
                           <description>Idle state</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DBGA</name>
                           <description>Debug message A received</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DBGB</name>
                           <description>Debug message A/B received</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DBGC</name>
                           <description>Debug message A/B/C received, DMA request set</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RXF1A</name>
               <description>Rx FIFO 1 Acknowledge</description>
               <addressOffset>0x1B8</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>F1AI</name>
                     <description>Rx FIFO 1 Acknowledge Index</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>6</bitWidth>
                  </field>
               </fields>
            </register>
