Ac6Embedded/svd-microchip/PIC32CM_SG00/PIC32CM5112SG00048.svd
            <register>
               <name>INTFLAG</name>
               <description>Interrupt Flag REGISTER</description>
               <addressOffset>0x10</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
               <fields>
                  <field>
                     <name>SERR</name>
                     <description>Flash SEC Interrupt Flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SERRSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No Interrupt Pending</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>SECCNT Count reached</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CRCDONE</name>
                     <description>CRC Calculation Done Flag</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CRCDONESelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No Interrupt Pending</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Calculation Done</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CRCERR</name>
                     <description>CRC Error Flag</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CRCERRSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No Interrupt Pending</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>CRCACC Is Not Equal to the XOR of CRCSUM and CRCFXOR</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FLTCAP</name>
                     <description>ECC Fault Capture Flag</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>FLTCAPSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No Interrupt Pending</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>An ECC Fault Capture, related to FLTMD[], occurred</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>INTFLAGSET</name>
               <description>Interrupt Flag Set REGISTER</description>
               <addressOffset>0x14</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
               <fields>
                  <field>
                     <name>SERR</name>
                     <description>Flash SEC Interrupt Flag</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SERRSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No Interrupt Pending</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>SECCNT Count reached</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CRCDONE</name>
                     <description>CRC Calculation Done Flag</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CRCDONESelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No effect</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Set Interrupt Pending</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CRCERR</name>
                     <description>CRC Error Flag</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CRCERRSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No effect</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Set Interrupt Pending</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FLTCAP</name>
                     <description>ECC Fault Capture Flag</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>FLTCAPSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No effect</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Set Interrupt Pending</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUS</name>
               <description>Status REGISTER</description>
               <addressOffset>0x18</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0xE0000000</resetValue>
               <fields>
                  <field>
                     <name>PRM</name>
                     <description>NVM Power Reduction Mode Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PRMSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Flash is Ready (for read or NVMOP)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Flash is Powered Down and wakes on first access (read or NVMOP)</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>DBGCTRL</name>
               <description>Debug Control CTRL REGISTER</description>
               <addressOffset>0x1C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CRCRUN</name>
                     <description>CRC Debug Run Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CRCRUNSelect</name>
                        <enumeratedValue>
                           <name>HALT</name>
                           <description>CRC Logic Halts in Debug Mode</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RUN</name>
                           <description>CRC Logic Runs in Debug Mode.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>DBGECC</name>
                     <description>Debug ECC ModeECC errors from debugger reads are:</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>DBGECCSelect</name>
                        <enumeratedValue>
                           <name>NOERR</name>
                           <description>Corrected per ECCCTRL; No Bus ERR; INTFLAG, SEC counter, and FLT logic are not updated.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Not corrected; No Bus Error; INTFLAG, SEC counter, and FLT logic are not updated.</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Corrected per ECCCTRL; Bus Error, INTFLAG, SEC counter, and FLT logic operates as setup.</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RSVD11</name>
                           <description>Don't use but same as 01 (DISABLE)</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>ECCCTRL</name>
               <description>ECC Control REGISTER</description>
               <addressOffset>0x20</addressOffset>
               <size>32</size>
               <resetValue>0x00000040</resetValue>
               <fields>
                  <field>
                     <name>ECCCTL</name>
                     <description>NVM ECC Mode Control - restricts one or more NVMOPs</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>ECCCTLSelect</name>
                        <enumeratedValue>
                           <name>STRICT</name>
                           <description>ECC Writes with ECC Reads (NVMOP = Single Program Operation disabled)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DYNAMIC</name>
                           <description>Dynamic Writes with Dynamic Reads</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ECC</name>
                           <description>ECC Writes with Dynamic Reads (NVMOP = Single Program Operation disabled)</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Dynamic Writes with No Error Check Reads</description>
                           <value>3</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ECCUNLCK</name>
                     <description>NVM ECC Mode Control Unlock</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ECCUNLCKSelect</name>
                        <enumeratedValue>
                           <name>LOCKED</name>
                           <description>ECCUNLCK and ECCCTL[1:0] cannot be written</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>UNLOCKED</name>
                           <description>ECCUNLCK and ECCCTL[1:0] can be written</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SECCNT</name>
                     <description>Flash SEC Count</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CRCCTRL</name>
               <description>CRC Control REGISTER</description>
               <addressOffset>0x24</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CRCRST</name>
                     <description>CRC Reset</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CRCRSTSelect</name>
                        <enumeratedValue>
                           <name>NONE</name>
                           <description>No Action</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RESET</name>
                           <description>Resets all CRC SFR bits.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>CRCEN</name>
                     <description>Start CRC Calculation</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CRCENSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Stops CRC calculation.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>CRC Calculation Enabled (w/ start on write to 1).</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>CRC Run in Standby</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RUNSTDBYSelect</name>
                        <enumeratedValue>
                           <name>HALT</name>
                           <description>CRC Halts in Standby</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>RUN</name>
                           <description>CRC Runs in Standby but only if STATUS.PRM=0 (i.e. Flash is in Auto Standby)</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CRCMODE</name>
               <description>CRC MODE REGISTER</description>
               <addressOffset>0x28</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PLEN32</name>
                     <description>Polynomial Length Select</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PLEN32Select</name>
                        <enumeratedValue>
                           <name>SIXTEEN</name>
                           <description>Polynomial is 16-bits</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>THIRTYTWO</name>
                           <description>Polynomial is 32-bits</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>AUTOR</name>
                     <description>CRC Auto Repeat</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>AUTORSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>Perform CRC calculation once then set DONE and if needed, CRCERR.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Continually Repeat CRC calculation; stop on error, set CRCDONE and CRCERR</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ROUT</name>
                     <description>CRC Reflected Output</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ROUTSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>The CRCACC is Not Reflected</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>The CRCACC is Reflected (before the Final XOR)</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RIN</name>
                     <description>CRC Reflected Input</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RINSelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>The LFSR CRC is calculated Most Significant Bit first (Not Reflected)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>The LFSR CRC is calculated Least Significant Bit first (Reflected)</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PERIOD</name>
                     <description>Read Period in PerCLK counts</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>12</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CRCPAUSE</name>
               <description>CRC Pause REGISTER</description>
               <addressOffset>0x2C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>PAUSE</name>
                     <description>CRC Pause</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PAUSESelect</name>
                        <enumeratedValue>
                           <name>DISABLE</name>
                           <description>CRC Reads Flash as Required</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENABLE</name>
                           <description>Pause CRC Reads of Flash</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
