Ac6Embedded/svd-microchip/PIC32CM_SG00/PIC32CM5112SG00048.svd
         </registers>
      </peripheral>
      <peripheral derivedFrom="H2PB0">
         <name>H2PB1</name>
         <baseAddress>0x44838000</baseAddress>
      </peripheral>
      <peripheral derivedFrom="H2PB0">
         <name>H2PB2</name>
         <baseAddress>0x4500E000</baseAddress>
      </peripheral>
      <peripheral>
         <name>HMATRIX2</name>
         <version>bus_hmatrix2_v55f0</version>
         <description>HSB Matrix</description>
         <baseAddress>0x44010000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x178</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>HMATRIX2</name>
            <value>47</value>
         </interrupt>
         <registers>
            <register>
               <dim>6</dim>
               <dimIncrement>4</dimIncrement>
               <name>MCFG[%s]</name>
               <description>Master Configuration</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000002</resetValue>
               <fields>
                  <field>
                     <name>ULBT</name>
                     <description>Undefined Length Burst Type</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>3</bitWidth>
                     <enumeratedValues>
                        <name>ULBTSelect</name>
                        <enumeratedValue>
                           <name>INFINITE</name>
                           <description>Infinite Length</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SINGLE</name>
                           <description>Single Access</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FOUR_BEAT</name>
                           <description>Four Beat Burst</description>
                           <value>2</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>EIGHT_BEAT</name>
                           <description>Eight Beat Burst</description>
                           <value>3</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>SIXTEEN_BEAT</name>
                           <description>Sixteen Beat Burst</description>
                           <value>4</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <dim>9</dim>
               <dimIncrement>4</dimIncrement>
               <name>SCFG[%s]</name>
               <description>Slave Configuration</description>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <resetValue>0x00000010</resetValue>
               <fields>
                  <field>
                     <name>SLOT_CYCLE</name>
                     <description>Maximum Number of Allowed Cycles for a Burst</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>9</bitWidth>
                  </field>
                  <field>
                     <name>DEFMSTR_TYPE</name>
                     <description>Default Master Type</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>2</bitWidth>
                     <enumeratedValues>
                        <name>DEFMSTR_TYPESelect</name>
                        <enumeratedValue>
                           <name>NO_DEFAULT</name>
                           <description>No Default Master. At the end of current slave access, if no other master request is pending, the slave is deconnected from all masters. This resusts in having a one cycle latency for the first transfer of a burst.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>LAST_DEFAULT</name>
                           <description>Last Default Master At the end of current slave access, if no other master request is pending, the slave stay connected with the last master havingaccessed it.This resusts in not having the one cycle latency when the last master re-trying access on the slave.</description>
                           <value>1</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>FIXED_DEFAULT</name>
                           <description>Fixed Default Master At the end of current slave access, if no other master request is pending, the slave connects with fixed master which numberis in FIXED_DEFMSTR register.This resusts in not having the one cycle latency when the fixed master re-trying access on the slave.</description>
                           <value>2</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>FIXED_DEFMSTR</name>
                     <description>Fixed Index of Default Master</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
               </fields>
            </register>
            <cluster>
               <dim>9</dim>
               <dimIncrement>0x8</dimIncrement>
               <name>PRS[%s]</name>
               <description/>
               <addressOffset>0x080</addressOffset>
               <register>
                  <name>PRAS</name>
                  <description>Priority A for Slave</description>
                  <addressOffset>0x0</addressOffset>
                  <size>32</size>
                  <resetValue>0x00000000</resetValue>
                  <fields>
                     <field>
                        <name>M0PR</name>
                        <description>Master 0 Priority</description>
                        <bitOffset>0</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>LQOSEN0</name>
                        <description>Latency Quality Of Service Enable for Master 0</description>
                        <bitOffset>2</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>M1PR</name>
                        <description>Master 1 Priority</description>
                        <bitOffset>4</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>LQOSEN1</name>
                        <description>Latency Quality Of Service Enable for Master 1</description>
                        <bitOffset>6</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>M2PR</name>
                        <description>Master 2 Priority</description>
                        <bitOffset>8</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>LQOSEN2</name>
                        <description>Latency Quality Of Service Enable for Master 2</description>
                        <bitOffset>10</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>M3PR</name>
                        <description>Master 3 Priority</description>
                        <bitOffset>12</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>LQOSEN3</name>
                        <description>Latency Quality Of Service Enable for Master 3</description>
                        <bitOffset>14</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>M4PR</name>
                        <description>Master 4 Priority</description>
                        <bitOffset>16</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>LQOSEN4</name>
                        <description>Latency Quality Of Service Enable for Master 4</description>
                        <bitOffset>18</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                     <field>
                        <name>M5PR</name>
                        <description>Master 5 Priority</description>
                        <bitOffset>20</bitOffset>
                        <bitWidth>2</bitWidth>
                     </field>
                     <field>
                        <name>LQOSEN5</name>
                        <description>Latency Quality Of Service Enable for Master 5</description>
                        <bitOffset>22</bitOffset>
                        <bitWidth>1</bitWidth>
                     </field>
                  </fields>
               </register>
            </cluster>
            <register>
               <name>MRCR</name>
               <description>Master Remap Control</description>
               <addressOffset>0x100</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>RCB0</name>
                     <description>Remap Command Bit for Master 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RCB0Select</name>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Disable remapped address decoding for master</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENA</name>
                           <description>Enable remapped address decoding for master</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RCB1</name>
                     <description>Remap Command Bit for Master 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RCB1Select</name>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Disable remapped address decoding for master</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENA</name>
                           <description>Enable remapped address decoding for master</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RCB2</name>
                     <description>Remap Command Bit for Master 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RCB2Select</name>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Disable remapped address decoding for master</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENA</name>
                           <description>Enable remapped address decoding for master</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RCB3</name>
                     <description>Remap Command Bit for Master 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RCB3Select</name>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Disable remapped address decoding for master</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENA</name>
                           <description>Enable remapped address decoding for master</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RCB4</name>
                     <description>Remap Command Bit for Master 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RCB4Select</name>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Disable remapped address decoding for master</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENA</name>
                           <description>Enable remapped address decoding for master</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RCB5</name>
                     <description>Remap Command Bit for Master 5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RCB5Select</name>
                        <enumeratedValue>
                           <name>DIS</name>
                           <description>Disable remapped address decoding for master</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>ENA</name>
                           <description>Enable remapped address decoding for master</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <dim>9</dim>
               <dimIncrement>4</dimIncrement>
               <name>SFR[%s]</name>
               <description>Special Function</description>
               <addressOffset>0x110</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SFR</name>
                     <description>Special Function Register</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MEIER</name>
               <description>Master Error Interrupt Enable</description>
               <addressOffset>0x150</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>MERR0</name>
                     <description>Master 0 Access Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR1</name>
                     <description>Master 1 Access Error</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR2</name>
                     <description>Master 2 Access Error</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR3</name>
                     <description>Master 3 Access Error</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR4</name>
                     <description>Master 4 Access Error</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR5</name>
                     <description>Master 5 Access Error</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MEIDR</name>
               <description>Master Error Interrupt Disable</description>
               <addressOffset>0x154</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>MERR0</name>
                     <description>Master 0 Access Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR1</name>
                     <description>Master 1 Access Error</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR2</name>
                     <description>Master 2 Access Error</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR3</name>
                     <description>Master 3 Access Error</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR4</name>
                     <description>Master 4 Access Error</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR5</name>
                     <description>Master 5 Access Error</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MEIMR</name>
               <description>Master Error Interrupt Mask</description>
               <addressOffset>0x158</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MERR0</name>
                     <description>Master 0 Access Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR1</name>
                     <description>Master 1 Access Error</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR2</name>
                     <description>Master 2 Access Error</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR3</name>
                     <description>Master 3 Access Error</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR4</name>
                     <description>Master 4 Access Error</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR5</name>
                     <description>Master 5 Access Error</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>MESR</name>
               <description>Master Error Status</description>
               <addressOffset>0x15C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <modifiedWriteValues>oneToClear</modifiedWriteValues>
               <fields>
                  <field>
                     <name>MERR0</name>
                     <description>Master 0 Access Error</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR1</name>
                     <description>Master 1 Access Error</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR2</name>
                     <description>Master 2 Access Error</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR3</name>
                     <description>Master 3 Access Error</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR4</name>
                     <description>Master 4 Access Error</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>MERR5</name>
                     <description>Master 5 Access Error</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <dim>6</dim>
               <dimIncrement>4</dimIncrement>
               <name>MEAR[%s]</name>
               <description>Master Error Address</description>
               <addressOffset>0x160</addressOffset>
               <size>32</size>
               <access>read-only</access>
            </register>
