Ac6Embedded/svd-microchip/PIC32CM_SG00/PIC32CM5112SG00048.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>PUF</name>
         <version>048911a0</version>
         <description>Physically Unclonable Function</description>
         <baseAddress>0x44834000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x300</size>
            <usage>registers</usage>
         </addressBlock>
         <interrupt>
            <name>PUF</name>
            <value>140</value>
         </interrupt>
         <registers>
            <register>
               <name>CTRLA</name>
               <description>Control Register A</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SWRST</name>
                     <description>Software ResetNOTE: Reset to PUF must be held active long enough to reset complete macro.</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SWRSTSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>No effect</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Reset registers and internal state</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>ENABLE</name>
                     <description>Clock Enable bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ENABLESelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>PUF clock is disabled and Macro held in reset and any access to QK register would cause PSLVERR.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>PUF clock is enabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>PRIV</name>
                     <description>Privileged Access Only</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>PRIVSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>PUF registers accessible in privileged and unprivileged modes.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>PUF registers only accessible in privileged mode.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RUNSTDBY</name>
                     <description>RUNSTDBY Enable bit - not used by EIP HWWriting this register has no affect on the EIPNote: Currently this bit is present, but has no functionality. This bit is part of the IP wrapper but has no use for the EIP.</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>STATUSA</name>
               <description>Status Register A</description>
               <addressOffset>0x38</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>BUSY</name>
                     <description>PUF Busy indicator</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>BUSYSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Macro can accept commands.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Macro has not completed the power up or power down sequence and cannot accept any other commands.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>DISABLE</name>
               <description>Disable Function Control Register</description>
               <addressOffset>0x100</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <modifiedWriteValues>oneToSet</modifiedWriteValues>
               <fields>
                  <field>
                     <name>ENROLL</name>
                     <description>ENROLL Command Disable bit</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>ENROLLSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Command is enabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Command is disabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>START</name>
                     <description>START Command Disable bit</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>STARTSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Command is enabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Command is disabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>RECONSTRUCT</name>
                     <description>RECONSTRUCT Command Disable bit</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>RECONSTRUCTSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Command is enabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Command is disabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>STOP</name>
                     <description>STOP Command Disable bit</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>STOPSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Command is enabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Command is disabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>GET_KEY</name>
                     <description>GET_KEY Command Disable bit</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>GET_KEYSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Command is enabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Command is disabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>UNWRAP</name>
                     <description>UNWRAP Command Disable bit</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>UNWRAPSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Command is enabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Command is disabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WRAP_GEN_RAND</name>
                     <description>WRAP_GENERATE_RANDOM Command Disable bit</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>WRAP_GEN_RANDSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Command is enabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Command is disabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>WRAP</name>
                     <description>WRAP Command Disable bit</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>WRAPSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Command is enabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Command is disabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>GEN_RAND</name>
                     <description>GENERATE_RANDOM Command Disable bit</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>GEN_RANDSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Command is enabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Command is disabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>SKIP_MEM_TEST</name>
                     <description>SKIP_MEMORY TEST Command Control bit</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SKIP_MEM_TESTSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Command is enabled / Not Skipped.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Command is disabled / Skipped during initialization</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TEST_MEM</name>
                     <description>TEST_MEMORY Command Disable bit</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>TEST_MEMSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Command is enabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Command is disabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
                  <field>
                     <name>TEST_PUF</name>
                     <description>TEST_PUF Command Disable bit</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>TEST_PUFSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>Command is enabled.</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Command is disabled.</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>RESTRICT0</name>
               <description>Restrict User Context 0 Control Register</description>
               <addressOffset>0x104</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <modifiedWriteValues>oneToSet</modifiedWriteValues>
               <fields>
                  <field>
                     <name>RESTRICT_CONTEXT_0</name>
                     <description>Restrict User Context Writing a 1 in a bit position prevents other PUF keys to be generated with this context bit set. NOTE: Refer to the EIP datasheet for the function of the restrict_user_context signals</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RESTRICT1</name>
               <description>Restrict User Context 1 Control Register</description>
               <addressOffset>0x108</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <modifiedWriteValues>oneToSet</modifiedWriteValues>
               <fields>
                  <field>
                     <name>RESTRICT_CONTEXT_1</name>
                     <description>Restrict User Context Writing a 1 in a bit position prevents other PUF keys to be generated with this context bit set. NOTE: Refer to the EIP datasheet for the function of the restrict_user_context signals</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTRL_PWR</name>
               <description>Power Control Register</description>
               <addressOffset>0x10C</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>SRAM_PWRSW</name>
                     <description>SRAM Power Switch Enable Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>SRAM_PWRSWSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>SRAM register power is disabled ( puf_req_power_sram driven to 0)</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>SRAM register power is enabled ( puf_req_power_sram driven to 1)</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>CTRL_KEY</name>
               <description>KEY Control Register</description>
               <addressOffset>0x110</addressOffset>
               <size>32</size>
               <resetValue>0x00000000</resetValue>
               <fields>
                  <field>
                     <name>CLR_PUF_KEY</name>
                     <description>Clear PUF Key Control Bit</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                     <enumeratedValues>
                        <name>CLR_PUF_KEYSelect</name>
                        <enumeratedValue>
                           <name>0</name>
                           <description>NO Affect</description>
                           <value>0</value>
                        </enumeratedValue>
                        <enumeratedValue>
                           <name>1</name>
                           <description>Clears the following outputs from this macro - puf_key, puf_valid, puf_index</description>
                           <value>1</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
